// Проанализировать персонажей "Крестьянин, Разбойник, Снайпер, Колдун, Копейщик, Арбалетчик, Монах". Для каждого определит 8 полей данных(здоровье, сила итд) 3-4 поля поведения(методов атаковать, вылечить итд). Создать абстрактный класс и иерархию наследников. Расположить классы в пакет так, чтобы в основной программе небыло видно их полей. В не абстрактных классах переопределить метод toString() так чтобы он возвращал название класса или имя. Создать в основной программе по одному обьекту каждого не абстрактного класса и вывести в консоль его имя.

// Создать две команды по 10 человек. Первая команда: крестьянин, волшебник, арбалетчик, копейщик. Вторая: крестьянин, снайпер, монах и вор. Каждому задать случайное имя и вывести в консоль. Добавить в проект класс, предназначенный для хранения координат. Добавить в абстрактный класс поле, экземпляр класс координат. Пробросить координаты через конструкторы наследников так, чтобы создавая объекты вы передавали в параметрах имя и аоординаты. Скорректировать алгоритм заполнения комманд. Кроме имён каждый персонаж должен иметь координаты. Одна комманда находится с левой стороны другая с правой(у=0 и у=9). В класс лучников добавить метод поиск ближайшего противника. Алгоритм расчёта расстояний реализовать в классе координат.

import java.util.ArrayList;

import TeamBuilder.TeamBuilder;
import units.*;

public class Main {
    public static void main(String[] args) {
        TeamBuilder teams = new TeamBuilder();
        ArrayList<Person> hollyTeam = teams.getHollyTeam();
        ArrayList<Person> darkTeam = teams.getDarkTeam();
        System.out.println("\n" + hollyTeam + "\n");
        System.out.println(darkTeam + "\n");
        System.out.println(hollyTeam.get(3).findNearestEnemy(darkTeam));
    }
}